app/views/comments/_comment.html.erb

<p><%= comment.description %>
<small class="labled">Created: <%= time_ago_in_words(comment.created_at) %> ago
---
INSERT INTO "comments" ("description", "user_id", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "Get you wellies ready"], ["user_id", 2], ["topic_id", 7], ["created_at", "2018-10-29 15:25:28.219004"], ["updated_at", "2018-10-29 15:25:28.219004"]]