app/views/topics/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."topic_id" = ?  [["topic_id", 7]]
---
                   <p class="createdByText"><span class="createdHeader">created by:</span> <%=top.user.name %></p>
                       <small>Comments: <%= top.comments.count %></small></p>