app/views/topics/show.html.erb

            <div class="comment-bar">
              <% if @topic.comments.count > 0 %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."topic_id" = ?  [["topic_id", 7]]