app/views/users/show.html.erb

      </h5>
      <% if @user.topics.count !=0 %>
---
SELECT COUNT(*) FROM "topics" WHERE "topics"."user_id" = ?  [["user_id", 2]]