app/controllers/comments_controller.rb

  def create
    @topic = Topic.find(params[:topic_id])
    @comment = @topic.comments.build(comment_params)
    @comment.user = current_user
    if @comment.save
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("description", "user_id", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "Better close your windows and ride it out!"], ["user_id", 1], ["topic_id", 7], ["created_at", "2018-10-29 14:05:29.083724"], ["updated_at", "2018-10-29 14:05:29.083724"]]