app/controllers/topics_controller.rb

  def create
    @topic = Topic.new(topic_params)
    @topic.user = current_user
   if @topic.save
---
INSERT INTO "topics" ("name", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "Shopping"], ["description", "Go to Supermarket to prepare for Saturday"], ["created_at", "2018-10-26 10:09:20.317575"], ["updated_at", "2018-10-26 10:09:20.317575"], ["user_id", 1]]

  def update

     if @topic.update(topic_params)
---
UPDATE "topics" SET "description" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["description", "Whats the plan for Saturday? and Sunday"], ["updated_at", "2018-10-23 10:19:22.185362"], ["id", 3]]

  def like
    like = Like.create(like: params[:like], user: current_user, topic: @topic)
---
INSERT INTO "likes" ("like", "user_id", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["like", "t"], ["user_id", 2], ["topic_id", 11], ["created_at", "2018-11-01 12:16:30.820559"], ["updated_at", "2018-11-01 12:16:30.820559"]]