app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?)  [["name", "Bob Cross"], ["email", "bob@aymes.com"], ["created_at", "2018-10-25 14:02:23.717351"], ["updated_at", "2018-10-25 14:02:23.717351"], ["picture", "10.jpg"]]
---
  def create
    @user = User.new(user_params)
   if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "picture" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["picture", "vincethewalker.png"], ["updated_at", "2018-10-25 13:17:31.798896"], ["id", 1]]
---
  def update
     @user = User.find(params[:id])
     if @user.update(user_params)